# ----------------------------------------------------------------
# Cask Install Options
# ----------------------------------------------------------------
# appdir: "/Applications"
#   Place all GUI applications together in /Applications.
#
# no_quarantine: true
#   Skip the initial Gatekeeper dialog "App downloaded from the Internet..." on first launch.
cask_args appdir: "/Applications", no_quarantine: true

# Organize software neatly under a single directory tree (e.g. /usr/local) https://www.gnu.org/software/stow/
brew "stow"

# ----------------------------------------------------------------
# Fonts
# ----------------------------------------------------------------

# tap "homebrew/cask-fonts" 

# Nerd Font
cask "font-hack-nerd-font"

# ----------------------------------------------------------------
# Prompt
# ----------------------------------------------------------------

# Terminal emulator that uses platform-native UI and GPU acceleration https://ghostty.org/
cask "ghostty"

# Cross-shell prompt for astronauts https://starship.rs
brew "starship"

# Pluggable terminal workspace, with terminal multiplexer as the base feature https://zellij.dev/
brew "zellij"

# ----------------------------------------------------------------
# Shell Development Environments
# ----------------------------------------------------------------

# Autoformat shell script source code https://github.com/mvdan/sh
brew "shfmt"

# Static analysis and lint tool, for (ba)sh scripts https://www.shellcheck.net/
brew "shellcheck"

# ----------------------------------------------------------------
# Brew
# ----------------------------------------------------------------

# Distributed revision control system. https://git-scm.com
brew "git"

# GitHub command-line tool. https://github.com/cli/cli
brew "gh"

# Fuzzy finder for the command-line https://github.com/junegunn/fzf
brew "fzf"

# GitHub repository manager. https://github.com/x-motemen/ghq
brew "ghq"

# GNU grep, egrep and fgrep https://www.gnu.org/software/grep/
brew "grep"

# Lightweight and flexible command-line JSON processor https://stedolan.github.io/jq/
brew "jq"

# ----------------------------------------------------------------
# Cask
# ----------------------------------------------------------------

# Web browser https://arc.net/
cask "arc"

# Anthropic's official Claude AI desktop app https://www.anthropic.com/
cask "claude"

# Replacement for Docker Desktop https://orbstack.dev/
cask "orbstack"

# Control your tools with a few keystrokes https://raycast.app/
cask "raycast"

# Team communication and collaboration software. https://slack.com
cask "slack"

# Keyboard customizer. https://pqrs.org/osx/karabiner
cask "karabiner-elements"

# Open-source code editor. https://code.visualstudio.com
cask "visual-studio-code"

# Video communication and virtual meeting platform https://www.zoom.us/
cask "zoom"