# ----------------------------------------------------------------
# Cask Install Options
# ----------------------------------------------------------------
# appdir: "/Applications"
#   Place all GUI applications together in /Applications.
#
# no_quarantine: true
#   Skip the initial Gatekeeper dialog "App downloaded from the Internet..." on first launch.
cask_args appdir: "/Applications", no_quarantine: true

# Organize software neatly under a single directory tree (e.g. /usr/local) https://www.gnu.org/software/stow/
brew "stow"

# ----------------------------------------------------------------
# Fonts
# ----------------------------------------------------------------

# tap "homebrew/cask-fonts"

# Nerd Font
cask "font-hack-nerd-font"

# ----------------------------------------------------------------
# Prompt
# ----------------------------------------------------------------

# Terminal emulator that uses platform-native UI and GPU acceleration https://ghostty.org/
cask "ghostty"

# Cross-shell prompt for astronauts https://starship.rs
brew "starship"

# Pluggable terminal workspace, with terminal multiplexer as the base feature https://zellij.dev/
brew "zellij"

# Fish shell like syntax highlighting for zsh https://github.com/zsh-users/zsh-syntax-highlighting
brew "zsh-syntax-highlighting"

# ----------------------------------------------------------------
# Shell Development Environments
# ----------------------------------------------------------------

# Static analysis and lint tool, for (ba)sh scripts https://www.shellcheck.net/
brew "shellcheck"

# Autoformat shell script source code https://github.com/mvdan/sh
brew "shfmt"

# ----------------------------------------------------------------
# Brew
# ----------------------------------------------------------------

# Cat(1) clone with syntax highlighting and Git integration. https://github.com/sharkdp/bat
brew "bat"

tap "FelixKratz/formulae"
brew "FelixKratz/formulae/borders"

# Modern replacement for ls. https://github.com/eza-community/eza
brew "eza"

# Fuzzy finder for the command-line https://github.com/junegunn/fzf
brew "fzf"

# Interact with Google Gemini AI models from the command-line https://github.com/google-gemini/gemini-cli
brew "gemini-cli"

# GitHub command-line tool. https://github.com/cli/cli
brew "gh"

# GitHub repository manager. https://github.com/x-motemen/ghq
brew "ghq"

# Distributed revision control system. https://git-scm.com
brew "git"

# GNU grep, egrep and fgrep https://www.gnu.org/software/grep/
brew "grep"

# Lightweight and flexible command-line JSON processor https://stedolan.github.io/jq/
brew "jq"

# Open source MCP server for databases https://github.com/googleapis/genai-toolbox
brew "mcp-toolbox"

# Dev Tools Management  https://mise.jdx.dev/
brew "mise"

# Search tool like grep and The Silver Searcher https://github.com/BurntSushi/ripgrep
brew "ripgrep"

# Terminal multiplexer https://tmux.github.io/
brew "tmux"

# ----------------------------------------------------------------
# Cask
# ----------------------------------------------------------------

# Password manager that keeps all passwords secure behind one password. https://1password.com
cask "1Password"

# Command-line helper for the 1Password password manager https://developer.1password.com/docs/cli
cask "1password-cli"

# AeroSpace is an i3-like tiling window manager for macOS https://github.com/nikitabobko/AeroSpace
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace"

# A Real Design-first API Development Platform https://apidog.com/
cask "apidog"

# FreeMacSoft AppCleaner https://freemacsoft.net/appcleaner/
cask "appcleaner"

# Web browser https://arc.net/
cask "arc"

# Anthropic's official Claude AI desktop app https://www.anthropic.com/
cask "claude"

# Terminal-based AI coding assistant https://www.anthropic.com/claude-code
cask "claude-code"

# OpenAI's coding agent that runs in your terminal https://github.com/openai/codex
cask "codex"

# Voice and text chat software. https://discord.com
cask "discord"

# Set of tools to manage resources and applications hosted on Google Cloud https://cloud.google.com/cli/
cask "gcloud-cli"

# Web browser https://www.google.com/chrome
cask "google-chrome"

# Client for the Google Drive storage service https://www.google.com/drive/
cask "google-drive"

# Keyboard customizer. https://pqrs.org/osx/karabiner
cask "karabiner-elements"

# a purpose-built tool for planning and building products https://linear.app/homepage
cask "linear-linear"

# Logicool Options+ https://www.logicool.co.jp/ja-jp/software/logi-options-plus.html
cask "logi-options+"

# Knowledge base that works on top of a local folder of plain text Markdown files https://obsidian.md/
cask "obsidian"

# Replacement for Docker Desktop https://orbstack.dev/
cask "orbstack"

# Control your tools with a few keystrokes https://raycast.app/
cask "raycast"

# Screenshot measurement and annotation tool https://shottr.cc/
cask "shottr"

# Team communication and collaboration software. https://slack.com
cask "slack"

# Native GUI tool for relational databases https://tableplus.com/
cask "tableplus"

# Open-source code editor. https://code.visualstudio.com
cask "visual-studio-code"

# Code editor designed for high-performance collaboration with humans and AI. https://zed.dev/
cask "zed"

# Video communication and virtual meeting platform https://www.zoom.us/
cask "zoom"

# ----------------------------------------------------------------
# Mas
#
# Search `mas search <app_name>`
# info   `mas info <app_id>`
# ----------------------------------------------------------------

# Simple command line interface for the Mac App Store. https://github.com/mas-cli/mas
brew "mas"

# Interface for reading and syncing eBooks. https://www.amazon.com/gp/digital/fiona/kcp-landing-page
# mas "Kindle", id: 302584613

mas "Toggl Track: Hours & Time Log", id: 1291898086
